; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	thermograph2 - mode
	image4 - mode
	infrared8 - mode
	thermograph7 - mode
	infrared6 - mode
	infrared1 - mode
	spectrograph0 - mode
	thermograph9 - mode
	spectrograph5 - mode
	thermograph3 - mode
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation0 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 thermograph7)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(supports instrument1 image4)
	(supports instrument1 spectrograph0)
	(supports instrument1 thermograph9)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument2 infrared1)
	(supports instrument2 infrared8)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 infrared6)
	(calibration_target instrument3 Star2)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument4 infrared6)
	(supports instrument4 thermograph2)
	(supports instrument4 spectrograph5)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet9)
	(supports instrument6 infrared8)
	(supports instrument6 thermograph3)
	(supports instrument6 thermograph9)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 thermograph9)
	(supports instrument7 infrared6)
	(calibration_target instrument7 Star4)
	(supports instrument8 thermograph2)
	(supports instrument8 infrared8)
	(supports instrument8 thermograph7)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation3)
)
(:goal (and
	(pointing satellite1 Star5)
	(pointing satellite2 Phenomenon8)
	(have_image Star5 infrared1)
	(have_image Star5 infrared8)
	(have_image Star5 spectrograph0)
	(have_image Phenomenon6 thermograph3)
	(have_image Phenomenon6 thermograph2)
	(have_image Phenomenon6 image4)
	(have_image Phenomenon7 image4)
	(have_image Phenomenon8 thermograph9)
	(have_image Phenomenon8 infrared8)
	(have_image Phenomenon8 spectrograph0)
	(have_image Planet9 spectrograph5)
	(have_image Planet9 thermograph3)
	(have_image Planet9 infrared8)
))

)

; plan
1. (turn_to satellite4 groundstation0 groundstation3)
   deleted: (pointing satellite4 groundstation3)
   added: (pointing satellite4 groundstation0)
   goals met: 0 of 15
2. (switch_on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 0 of 15
3. (calibrate satellite4 instrument6 groundstation0)
   added: (calibrated instrument6)
   goals met: 0 of 15
4. (turn_to satellite4 phenomenon6 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 phenomenon6)
   goals met: 0 of 15
5. (turn_to satellite3 groundstation3 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 groundstation3)
   goals met: 0 of 15
6. (turn_to satellite2 groundstation3 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 groundstation3)
   goals met: 0 of 15
7. (turn_to satellite1 groundstation0 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 15
8. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 0 of 15
9. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 15
10. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 15
11. (calibrate satellite3 instrument4 groundstation3)
   added: (calibrated instrument4)
   goals met: 0 of 15
12. (calibrate satellite2 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 0 of 15
13. (calibrate satellite1 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 15
14. (take_image satellite4 phenomenon6 instrument6 thermograph3)
   added: (have_image phenomenon6 thermograph3)
   goals met: 1 of 15
15. (turn_to satellite1 phenomenon6 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon6)
   goals met: 1 of 15
16. (take_image satellite1 phenomenon6 instrument1 image4)
   added: (have_image phenomenon6 image4)
   goals met: 2 of 15
17. (turn_to satellite1 phenomenon7 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon7)
   goals met: 2 of 15
18. (take_image satellite1 phenomenon7 instrument1 image4)
   added: (have_image phenomenon7 image4)
   goals met: 3 of 15
19. (turn_to satellite1 phenomenon8 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon8)
   goals met: 3 of 15
20. (take_image satellite1 phenomenon8 instrument1 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 4 of 15
21. (take_image satellite1 phenomenon8 instrument1 thermograph9)
   added: (have_image phenomenon8 thermograph9)
   goals met: 5 of 15
22. (turn_to satellite1 star5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star5)
   goals met: 6 of 15
23. (take_image satellite1 star5 instrument1 spectrograph0)
   added: (have_image star5 spectrograph0)
   goals met: 7 of 15
24. (turn_to satellite2 star5 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 star5)
   goals met: 7 of 15
25. (take_image satellite2 star5 instrument2 infrared1)
   added: (have_image star5 infrared1)
   goals met: 8 of 15
26. (take_image satellite2 star5 instrument2 infrared8)
   added: (have_image star5 infrared8)
   goals met: 9 of 15
27. (turn_to satellite2 phenomenon8 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 phenomenon8)
   goals met: 10 of 15
28. (take_image satellite2 phenomenon8 instrument2 infrared8)
   added: (have_image phenomenon8 infrared8)
   goals met: 11 of 15
29. (turn_to satellite3 phenomenon6 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 phenomenon6)
   goals met: 11 of 15
30. (take_image satellite3 phenomenon6 instrument4 thermograph2)
   added: (have_image phenomenon6 thermograph2)
   goals met: 12 of 15
31. (turn_to satellite3 planet9 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 planet9)
   goals met: 12 of 15
32. (take_image satellite3 planet9 instrument4 spectrograph5)
   added: (have_image planet9 spectrograph5)
   goals met: 13 of 15
33. (turn_to satellite4 planet9 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 planet9)
   goals met: 13 of 15
34. (take_image satellite4 planet9 instrument6 infrared8)
   added: (have_image planet9 infrared8)
   goals met: 14 of 15
35. (take_image satellite4 planet9 instrument6 thermograph3)
   added: (have_image planet9 thermograph3)
   goals met: 15 of 15
